import os,time
puntos=0

def questions():
    pregunta1='''

    ░██████╗░██╗░░░██╗███████╗  ███████╗░██████╗  ██╗░░░██╗███╗░░██╗
    ██╔═══██╗██║░░░██║██╔════╝  ██╔════╝██╔════╝  ██║░░░██║████╗░██║
    ██║██╗██║██║░░░██║█████╗░░  █████╗░░╚█████╗░  ██║░░░██║██╔██╗██║
    ╚██████╔╝██║░░░██║██╔══╝░░  ██╔══╝░░░╚═══██╗  ██║░░░██║██║╚████║
    ░╚═██╔═╝░╚██████╔╝███████╗  ███████╗██████╔╝  ╚██████╔╝██║░╚███║
    ░░░╚═╝░░░░╚═════╝░╚══════╝  ╚══════╝╚═════╝░  ░╚═════╝░╚═╝░░╚══╝

    ░█████╗░██╗░░░░░░██████╗░░█████╗░██████╗░██╗████████╗███╗░░░███╗░█████╗░░█████╗░
    ██╔══██╗██║░░░░░██╔════╝░██╔══██╗██╔══██╗██║╚══██╔══╝████╗░████║██╔══██╗██╔══██╗
    ███████║██║░░░░░██║░░██╗░██║░░██║██████╔╝██║░░░██║░░░██╔████╔██║██║░░██║╚═╝███╔╝
    ██╔══██║██║░░░░░██║░░╚██╗██║░░██║██╔══██╗██║░░░██║░░░██║╚██╔╝██║██║░░██║░░░╚══╝░
    ██║░░██║███████╗╚██████╔╝╚█████╔╝██║░░██║██║░░░██║░░░██║░╚═╝░██║╚█████╔╝░░░██╗░░
    ╚═╝░░╚═╝╚══════╝░╚═════╝░░╚════╝░╚═╝░░╚═╝╚═╝░░░╚═╝░░░╚═╝░░░░░╚═╝░╚════╝░░░░╚═╝░░

    𝖺) 𝖴𝗇𝖺 𝗌𝖾𝖼𝗎𝖾𝗇𝖼𝗂𝖺 𝖿𝗂𝗇𝗂𝗍𝖺 𝖽𝖾 𝗉𝖺𝗌𝗈𝗌 𝗉𝖺𝗋𝖺 𝗋𝖾𝗌𝗈𝗅𝗏𝖾𝗋 𝗎𝗇 𝗉𝗋𝗈𝖻𝗅𝖾𝗆𝖺.
    𝖻) 𝖴𝗇 𝗅𝖾𝗇𝗀𝗎𝖺𝗃𝖾 𝖽𝖾 𝗉𝗋𝗈𝗀𝗋𝖺𝗆𝖺𝖼𝗂𝗈́𝗇.
    𝖼) 𝖴𝗇𝖺 𝖾𝗌𝗍𝗋𝗎𝖼𝗍𝗎𝗋𝖺 𝖽𝖾 𝖽𝖺𝗍𝗈𝗌.
    𝖽) 𝖴𝗇𝖺 𝖻𝖺𝗌𝖾 𝖽𝖾 𝖽𝖺𝗍𝗈𝗌 𝗋𝖾𝗅𝖺𝖼𝗂𝗈𝗇𝖺𝗅.
    '''

    pregunta2='''

    █▀▀ █░█ ▄▀█ █░░   █▀▄ █▀▀   █░░ ▄▀█ █▀   █▀ █ █▀▀ █░█ █ █▀▀ █▄░█ ▀█▀ █▀▀ █▀   █▄░█ █▀█   █▀▀ █▀
    █▄▄ █▄█ █▀█ █▄▄   █▄▀ ██▄   █▄▄ █▀█ ▄█   ▄█ █ █▄█ █▄█ █ ██▄ █░▀█ ░█░ ██▄ ▄█   █░▀█ █▄█   ██▄ ▄█

    █░█ █▄░█ ▄▀█   █▀▀ █▀ ▀█▀ █▀█ █░█ █▀▀ ▀█▀ █░█ █▀█ ▄▀█   █▀▄ █▀▀   █▀▀ █▀█ █▄░█ ▀█▀ █▀█ █▀█ █░░   █▀▀ █▄░█
    █▄█ █░▀█ █▀█   ██▄ ▄█ ░█░ █▀▄ █▄█ █▄▄ ░█░ █▄█ █▀▄ █▀█   █▄▀ ██▄   █▄▄ █▄█ █░▀█ ░█░ █▀▄ █▄█ █▄▄   ██▄ █░▀█

    █▀█ █▀█ █▀█ █▀▀ █▀█ ▄▀█ █▀▄▀█ ▄▀█ █▀▀ █ █▀█ █▄░█ ▀█
    █▀▀ █▀▄ █▄█ █▄█ █▀▄ █▀█ █░▀░█ █▀█ █▄▄ █ █▄█ █░▀█ ░▄

    ᴀ) ɪғ-ᴇʟsᴇ
    ʙ) sᴡɪᴛᴄʜ-ᴄᴀsᴇ
    ᴄ) ᴅᴏ-ᴡʜɪʟᴇ
    ᴅ) ᴊᴜᴍᴘ-ᴛᴏ
    '''

    pregunta3='''

    ░██████╗░██╗░░░██╗███████╗  ███████╗░██████╗  ██╗░░░░░░█████╗░
    ██╔═══██╗██║░░░██║██╔════╝  ██╔════╝██╔════╝  ██║░░░░░██╔══██╗
    ██║██╗██║██║░░░██║█████╗░░  █████╗░░╚█████╗░  ██║░░░░░███████║
    ╚██████╔╝██║░░░██║██╔══╝░░  ██╔══╝░░░╚═══██╗  ██║░░░░░██╔══██║
    ░╚═██╔═╝░╚██████╔╝███████╗  ███████╗██████╔╝  ███████╗██║░░██║
    ░░░╚═╝░░░░╚═════╝░╚══════╝  ╚══════╝╚═════╝░  ╚══════╝╚═╝░░╚═╝

    ██████╗░███████╗░█████╗░██╗░░░██╗██████╗░░██████╗██╗██╗░░░██╗██╗██████╗░░█████╗░██████╗░  ███████╗███╗░░██╗
    ██╔══██╗██╔════╝██╔══██╗██║░░░██║██╔══██╗██╔════╝██║██║░░░██║██║██╔══██╗██╔══██╗██╔══██╗  ██╔════╝████╗░██║
    ██████╔╝█████╗░░██║░░╚═╝██║░░░██║██████╔╝╚█████╗░██║╚██╗░██╔╝██║██║░░██║███████║██║░░██║  █████╗░░██╔██╗██║
    ██╔══██╗██╔══╝░░██║░░██╗██║░░░██║██╔══██╗░╚═══██╗██║░╚████╔╝░██║██║░░██║██╔══██║██║░░██║  ██╔══╝░░██║╚████║
    ██║░░██║███████╗╚█████╔╝╚██████╔╝██║░░██║██████╔╝██║░░╚██╔╝░░██║██████╔╝██║░░██║██████╔╝  ███████╗██║░╚███║
    ╚═╝░░╚═╝╚══════╝░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═════╝░╚═╝░░░╚═╝░░░╚═╝╚═════╝░╚═╝░░╚═╝╚═════╝░  ╚══════╝╚═╝░░╚══╝

    ██████╗░██████╗░░█████╗░░██████╗░██████╗░░█████╗░███╗░░░███╗░█████╗░░█████╗░██╗░█████╗░███╗░░██╗░█████╗░
    ██╔══██╗██╔══██╗██╔══██╗██╔════╝░██╔══██╗██╔══██╗████╗░████║██╔══██╗██╔══██╗██║██╔══██╗████╗░██║██╔══██╗
    ██████╔╝██████╔╝██║░░██║██║░░██╗░██████╔╝███████║██╔████╔██║███████║██║░░╚═╝██║██║░░██║██╔██╗██║╚═╝███╔╝
    ██╔═══╝░██╔══██╗██║░░██║██║░░╚██╗██╔══██╗██╔══██║██║╚██╔╝██║██╔══██║██║░░██╗██║██║░░██║██║╚████║░░░╚══╝░
    ██║░░░░░██║░░██║╚█████╔╝╚██████╔╝██║░░██║██║░░██║██║░╚═╝░██║██║░░██║╚█████╔╝██║╚█████╔╝██║░╚███║░░░██╗░░
    ╚═╝░░░░░╚═╝░░╚═╝░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚═╝░░╚═╝░╚════╝░╚═╝░╚════╝░╚═╝░░╚══╝░░░╚═╝░░

    ᴀ) Uɴ ᴀʟɢᴏʀɪᴛᴍᴏ ᴏ̨ᴜᴇ sᴇ ʀᴇsᴜᴇʟᴠᴇ ɪᴛᴇʀᴀᴛɪᴠᴀᴍᴇɴᴛᴇ.
    ʙ) Uɴ ᴀʟɢᴏʀɪᴛᴍᴏ ᴏ̨ᴜᴇ sᴇ ʟʟᴀᴍᴀ ᴀ sɪ́ ᴍɪsᴍᴏ.
    ᴄ) Uɴ ᴛɪᴘᴏ ᴅᴇ ʙᴜᴄʟᴇ.
    ᴅ) Uɴ ᴇʀʀᴏʀ ᴇɴ ᴇʟ ᴄᴏ́ᴅɪɢᴏ.
    '''

    pregunta4='''

    ░█▀▀█ █──█ █▀▀ 　 █▀▀ █▀▀ 　 ░█─░█ ▀▀█▀▀ ░█▀▄▀█ ░█─── ▀█ 
    ░█─░█ █──█ █▀▀ 　 █▀▀ ▀▀█ 　 ░█▀▀█ ─░█── ░█░█░█ ░█─── █▀ 
    ─▀▀█▄ ─▀▀▀ ▀▀▀ 　 ▀▀▀ ▀▀▀ 　 ░█─░█ ─░█── ░█──░█ ░█▄▄█ ▄─

    ᴀ) Uɴ ʟᴇɴɢᴜᴀᴊᴇ ᴅᴇ ᴘʀᴏɢʀᴀᴍᴀᴄɪᴏ́ɴ ᴘᴀʀᴀ ʙᴀsᴇs ᴅᴇ ᴅᴀᴛᴏs.
    ʙ) Uɴ ʟᴇɴɢᴜᴀᴊᴇ ᴅᴇ ᴍᴀʀᴄᴀᴅᴏ ᴘᴀʀᴀ ᴄʀᴇᴀʀ ᴘᴀ́ɢɪɴᴀs ᴡᴇʙ.
    ᴄ) Uɴ ʟᴇɴɢᴜᴀᴊᴇ ᴅᴇ ᴘʀᴏɢʀᴀᴍᴀᴄɪᴏ́ɴ ᴏʀɪᴇɴᴛᴀᴅᴏ ᴀ ᴏʙᴊᴇᴛᴏs.
    ᴅ) Uɴ ᴛɪᴘᴏ ᴅᴇ ʙᴀsᴇ ᴅᴇ ᴅᴀᴛᴏs.
    '''

    pregunta5='''

    ░██████╗░██╗░░░██╗███████╗  ░██████╗██╗░██████╗░███╗░░██╗██╗███████╗██╗░█████╗░░█████╗░
    ██╔═══██╗██║░░░██║██╔════╝  ██╔════╝██║██╔════╝░████╗░██║██║██╔════╝██║██╔══██╗██╔══██╗
    ██║██╗██║██║░░░██║█████╗░░  ╚█████╗░██║██║░░██╗░██╔██╗██║██║█████╗░░██║██║░░╚═╝███████║
    ╚██████╔╝██║░░░██║██╔══╝░░  ░╚═══██╗██║██║░░╚██╗██║╚████║██║██╔══╝░░██║██║░░██╗██╔══██║
    ░╚═██╔═╝░╚██████╔╝███████╗  ██████╔╝██║╚██████╔╝██║░╚███║██║██║░░░░░██║╚█████╔╝██║░░██║
    ░░░╚═╝░░░░╚═════╝░╚══════╝  ╚═════╝░╚═╝░╚═════╝░╚═╝░░╚══╝╚═╝╚═╝░░░░░╚═╝░╚════╝░╚═╝░░╚═╝

    ░██████╗░██████╗░██╗░░░░░░█████╗░
    ██╔════╝██╔═══██╗██║░░░░░██╔══██╗
    ╚█████╗░██║██╗██║██║░░░░░╚═╝███╔╝
    ░╚═══██╗╚██████╔╝██║░░░░░░░░╚══╝░
    ██████╔╝░╚═██╔═╝░███████╗░░░██╗░░
    ╚═════╝░░░░╚═╝░░░╚══════╝░░░╚═╝░░

    ᴀ) Sᴛᴀɴᴅᴀʀᴅ Qᴜᴇʀʏ Lᴀɴɢᴜᴀɢᴇ
    ʙ) Sᴛʀᴜᴄᴛᴜʀᴇᴅ Qᴜᴇʀʏ Lᴀɴɢᴜᴀɢᴇ
    ᴄ) Sʏsᴛᴇᴍ Qᴜᴇʀʏ Lᴀɴɢᴜᴀɢᴇ
    ᴅ) Sᴏғᴛᴡᴀʀᴇ Qᴜᴇʀʏ Lᴀɴɢᴜᴀɢᴇ

    '''
    return pregunta1,pregunta2,pregunta3,pregunta4,pregunta5

def animated_text(text):
    for c in text:
        print(c,end='',flush=True)
        time.sleep(0.03)

def bienvenida(m):
    print(f"Bienvenido @ {m} a la Trivia de Programación y Análisis de Software!\nHoy vamos a repasar algunos conceptos clave de programación y análisis de software de una manera divertida y dinámica.\n\n\n\nObjetivo del juego:\nEl objetivo de esta trivia es repasar los conceptos aprendidos en clase de una manera interactiva y divertida.\n\n\n\nModo de juego:\nPuedes participar de forma individual o en equipos.\nPuedes elegir entre un modo competitivo o colaborativo, ¡según tus preferencias!\nResponde cada pregunta con cuidado, ¡cada acierto suma puntos!\n\n\n")

def clasification(p1,p2,p3,p4,p5):
    global puntos
    if p1 =='a': 
        puntos+=10
    else:
        puntos+=0
    if p2=='d' :
        puntos+=50
    else:
        puntos+=0
    if p3=='b':
        puntos+=60
    else:
        puntos+=0
    if p4=='b':
        puntos+=90
    else:
        puntos+=0
    if p5=='a':
        puntos+=150
    else:
        puntos+=0
    print(f"Su puntuacion queda asi {puntos}") 

os.system('cls')
question1,question2,question3,question4,question5=questions() #Guardamos las variables 
animated_text("Para iniciar el juego escribe tu nombre\n")
name=input("Aca:").capitalize()
os.system('cls')



bienvenida(name)
tecla=input("<--- Presione una tecla --->")
os.system('cls')


print(question1)
q1=input("\nResponda Aca : ").lower()
os.system('cls')

print(question2)
q2=input("\nResponda Aca : ").lower()
os.system('cls')

print(question3)
q3=input("\nResponda Aca : ").lower()
os.system('cls')

print(question4)
q4=input("\nResponda Aca : ").lower()
os.system('cls')

print(question5)
q5=input("\nResponda Aca : ").lower()
os.system('cls')


os.system('cls')
clasification(q1,q2,q3,q4,q5)
